{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "otterhound",
    "1": "cocker_spaniel",
    "2": "brittany_spaniel",
    "3": "afghan_hound",
    "4": "maltese_dog",
    "5": "schipperke",
    "6": "irish_setter",
    "7": "pekinese",
    "8": "golden_retriever",
    "9": "vizsla",
    "10": "welsh_springer_spaniel",
    "11": "staffordshire_bullterrier",
    "12": "border_collie",
    "13": "irish_terrier",
    "14": "eskimo_dog",
    "15": "pug",
    "16": "kelpie",
    "17": "yorkshire_terrier",
    "18": "tibetan_terrier",
    "19": "walker_hound",
    "20": "affenpinscher",
    "21": "cardigan",
    "22": "english_springer",
    "23": "english_foxhound",
    "24": "west_highland_white_terrier",
    "25": "lakeland_terrier",
    "26": "rhodesian_ridgeback",
    "27": "gordon_setter",
    "28": "lhasa",
    "29": "curly",
    "30": "beagle",
    "31": "tibetan_mastiff",
    "32": "sussex_spaniel",
    "33": "saint_bernard",
    "34": "toy_terrier",
    "35": "standard_poodle",
    "36": "bernese_mountain_dog",
    "37": "pomeranian",
    "38": "ibizan_hound",
    "39": "redbone",
    "40": "toy_poodle",
    "41": "basset",
    "42": "scottish_deerhound",
    "43": "miniature_pinscher",
    "44": "basenji",
    "45": "border_terrier",
    "46": "bedlington_terrier",
    "47": "kerry_blue_terrier",
    "48": "weimaraner",
    "49": "english_setter",
    "50": "bluetick",
    "51": "boston_bull",
    "52": "italian_greyhound",
    "53": "dandie_dinmont",
    "54": "airedale",
    "55": "irish_water_spaniel",
    "56": "norfolk_terrier",
    "57": "wire",
    "58": "french_bulldog",
    "59": "soft",
    "60": "komondor",
    "61": "african_hunting_dog",
    "62": "siberian_husky",
    "63": "newfoundland",
    "64": "bouvier_des_flandres",
    "65": "saluki",
    "66": "shetland_sheepdog",
    "67": "collie",
    "68": "rottweiler",
    "69": "silky_terrier",
    "70": "norwegian_elkhound",
    "71": "chihuahua",
    "72": "leonberg",
    "73": "norwich_terrier",
    "74": "cairn",
    "75": "boxer",
    "76": "borzoi",
    "77": "dhole",
    "78": "samoyed",
    "79": "german_shepherd",
    "80": "labrador_retriever",
    "81": "blenheim_spaniel",
    "82": "groenendael",
    "83": "doberman",
    "84": "great_dane",
    "85": "flat",
    "86": "appenzeller",
    "87": "shih",
    "88": "japanese_spaniel",
    "89": "greater_swiss_mountain_dog",
    "90": "black",
    "91": "dingo",
    "92": "great_pyrenees",
    "93": "whippet",
    "94": "keeshond",
    "95": "malinois",
    "96": "american_staffordshire_terrier",
    "97": "mexican_hairless",
    "98": "giant_schnauzer",
    "99": "brabancon_griffon",
    "100": "kuvasz",
    "101": "miniature_poodle",
    "102": "irish_wolfhound",
    "103": "briard",
    "104": "clumber",
    "105": "standard_schnauzer",
    "106": "bull_mastiff",
    "107": "malamute",
    "108": "sealyham_terrier",
    "109": "entlebucher",
    "110": "chow",
    "111": "papillon",
    "112": "pembroke",
    "113": "german_short",
    "114": "old_english_sheepdog",
    "115": "chesapeake_bay_retriever",
    "116": "scotch_terrier",
    "117": "australian_terrier",
    "118": "miniature_schnauzer",
    "119": "bloodhound"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "affenpinscher": 20,
    "afghan_hound": 3,
    "african_hunting_dog": 61,
    "airedale": 54,
    "american_staffordshire_terrier": 96,
    "appenzeller": 86,
    "australian_terrier": 117,
    "basenji": 44,
    "basset": 41,
    "beagle": 30,
    "bedlington_terrier": 46,
    "bernese_mountain_dog": 36,
    "black": 90,
    "blenheim_spaniel": 81,
    "bloodhound": 119,
    "bluetick": 50,
    "border_collie": 12,
    "border_terrier": 45,
    "borzoi": 76,
    "boston_bull": 51,
    "bouvier_des_flandres": 64,
    "boxer": 75,
    "brabancon_griffon": 99,
    "briard": 103,
    "brittany_spaniel": 2,
    "bull_mastiff": 106,
    "cairn": 74,
    "cardigan": 21,
    "chesapeake_bay_retriever": 115,
    "chihuahua": 71,
    "chow": 110,
    "clumber": 104,
    "cocker_spaniel": 1,
    "collie": 67,
    "curly": 29,
    "dandie_dinmont": 53,
    "dhole": 77,
    "dingo": 91,
    "doberman": 83,
    "english_foxhound": 23,
    "english_setter": 49,
    "english_springer": 22,
    "entlebucher": 109,
    "eskimo_dog": 14,
    "flat": 85,
    "french_bulldog": 58,
    "german_shepherd": 79,
    "german_short": 113,
    "giant_schnauzer": 98,
    "golden_retriever": 8,
    "gordon_setter": 27,
    "great_dane": 84,
    "great_pyrenees": 92,
    "greater_swiss_mountain_dog": 89,
    "groenendael": 82,
    "ibizan_hound": 38,
    "irish_setter": 6,
    "irish_terrier": 13,
    "irish_water_spaniel": 55,
    "irish_wolfhound": 102,
    "italian_greyhound": 52,
    "japanese_spaniel": 88,
    "keeshond": 94,
    "kelpie": 16,
    "kerry_blue_terrier": 47,
    "komondor": 60,
    "kuvasz": 100,
    "labrador_retriever": 80,
    "lakeland_terrier": 25,
    "leonberg": 72,
    "lhasa": 28,
    "malamute": 107,
    "malinois": 95,
    "maltese_dog": 4,
    "mexican_hairless": 97,
    "miniature_pinscher": 43,
    "miniature_poodle": 101,
    "miniature_schnauzer": 118,
    "newfoundland": 63,
    "norfolk_terrier": 56,
    "norwegian_elkhound": 70,
    "norwich_terrier": 73,
    "old_english_sheepdog": 114,
    "otterhound": 0,
    "papillon": 111,
    "pekinese": 7,
    "pembroke": 112,
    "pomeranian": 37,
    "pug": 15,
    "redbone": 39,
    "rhodesian_ridgeback": 26,
    "rottweiler": 68,
    "saint_bernard": 33,
    "saluki": 65,
    "samoyed": 78,
    "schipperke": 5,
    "scotch_terrier": 116,
    "scottish_deerhound": 42,
    "sealyham_terrier": 108,
    "shetland_sheepdog": 66,
    "shih": 87,
    "siberian_husky": 62,
    "silky_terrier": 69,
    "soft": 59,
    "staffordshire_bullterrier": 11,
    "standard_poodle": 35,
    "standard_schnauzer": 105,
    "sussex_spaniel": 32,
    "tibetan_mastiff": 31,
    "tibetan_terrier": 18,
    "toy_poodle": 40,
    "toy_terrier": 34,
    "vizsla": 9,
    "walker_hound": 19,
    "weimaraner": 48,
    "welsh_springer_spaniel": 10,
    "west_highland_white_terrier": 24,
    "whippet": 93,
    "wire": 57,
    "yorkshire_terrier": 17
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.28.1"
}
